import React, { useEffect, useRef } from 'react';
import Image from 'next/image';

const Hero = () => {
  return (
    <section id="hero" className="d-flex align-items-center">
      <div className="container">
        <div className="row">
          <div className="col-lg-6 d-flex flex-column justify-content-center pt-4 pt-lg-0 order-2 order-lg-1" data-aos="fade-up" data-aos-delay="200">
          <h3>นวัตกรรมย้อนวัยไบโอแฮคกิ้ง (Biohacking)</h3>
            <p>จะดีกว่าไหมถ้าเราสามารถดูแลสุขภาพได้ถึงระดับยีนส์ในเซลล์ 
              มีงานวิจัยรองรับทางการแพทย์และทางวิทยาศาสตร์รองรับจากการค้นคว้ากว่า 40 ปี 
              โปรแทนดิมถูกคิดค้นและพัฒนาโดย ดร. โจ แมคคอร์ด 
              นักวิทยาศาสตร์ผู้ค้นพบซุปเปอร์ออกไซด์ดิสมิวเทส (SOD) 
              ซึ่งเป็นเอ็นไซม์ที่คัดแยกอนุมูลอิสระออกจากร่างกายมนุษย์ 
              ท่านเป็นผู้ได้รับรางวัลเหรียญทอง Elliott Cresson Medal 
              ซึ่งมอบให้ผู้ที่คิดค้นนวัตกรรมทางวิทยาศาสตร์และการค้นพบใหม่ๆ</p>

            <h3>โปรแทนดิมคืออะไร?</h3>

            <p>Protandim เกิดขึ้น จากคำถาม ว่า ” สุขภาพที่แย่ลง ในปัจจุบันของเรา 
              เป็นสิ่งที่เราต้องยอมรับว่าเกิดจากความเสื่อมของร่างกาย ตาม กาลเวลา ใช่หรือไม่ ?”
              นักวิจัย ก็เลยค้นพบว่า จริงๆ แล้ว ไม่ได้เกิดจากความชรา แต่เกิดจากความเสื่อมที่มี 
              อนุมูลอิสระเข้ามาทำร้ายเซลล์ โดยมาจากการหายใจ จำนวน 3 แสน ล้าน ล้าน ล้าน โมเลกุลต่อวัน 
              และยังมาจาก การกินอาหาร ดื่มน้ำ และอารมณ์ รวมถึงมลภาวะต่างๆ 
              ซึ่งมีจำนวนมากจนร่างกายไม่สามารถรับไหว เรียกว่า ความเสื่อม (Oxidative Stress) 
              เหมือน เหล็กที่มีสนิมเกาะ นานๆไป ก็ผุพัง เราจึงเกิดความแก่ เกิดความเสื่อม และก่อให้เกิดโรคต่าง ๆ 
              เพราะเกราะป้องกันของเรา ไม่ทำงาน จนคนทั่วไปคิดว่ามาจากความชรา</p>
          </div>
          <div className="col-lg-6 order-1 order-lg-2 hero-img" data-aos="zoom-in" data-aos-delay="200">
            <Image
              src="/img/protandimdual.png"
              className="img-fluid animated"
              alt="lfvn"
              width={400}
              height={400}
            />
          </div>
        </div>
      </div>
    </section>
  )
}

export default Hero;